app/views/songs/_form.html.erb

 <% if params[:artist_id] %>
  <%= artist_select(@song, Artist.find_by(params[:artist_id])) %>
---
SELECT  "artists".* FROM "artists" WHERE (1) LIMIT 1