app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
     if params[:artist_id]
       @artist = Artist.find_by(id: params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "artists".* FROM "artists" WHERE (1) LIMIT 1
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
---
  def edit
     if params[:artist_id]

       @artist = Artist.find_by(id: params[:artist_id])
        if @artist.nil?
          redirect_to artists_path, alert: "Artist not found."
        else
          if Song.find_by(id: params[:id]) && @artist.owns_song?(Song.find(params[:id]))